//
//  File.swift
//  changeViewWithoutSegue
//
//  Created by 양호준 on 2021/12/11.
//

import Foundation

struct Introduce {
    let title: String = "저를 소개합니다 😄"
    let body: String =
                    """
                    안녕하세요! iOS 개발자를 꿈꾸며 달려가고 있는 양호준입니다.
                    건국대학교 부동산학과를 졸업하고 서치펌, 부트캠프 등에서 HR 업무를 수행한 경험이 있습니다.
                    하지만 좀 더 다양한 사람들에게 가치를 줄 수 있는 일을 하고 싶다고 생각했고, 이에 가장 부합하는 것이 개발자라고 생각했습니다.
                                                            
                    그 중에서도 가장 처음 iOS 개발자를 선택한 이유는 단순히 Apple 제품이 좋아서였습니다.
                    iPad, iPhone, Macbook, apple watch, airpod Max, airpod Pro 등을 사용하며 만족했습니다.
                    단순히 하드웨어의 성능뿐만 아니라 소프트웨어도 깔끔하고 사용자 편의성을 많이 고려했다고 생각했습니다.
                    
                    따라서 내가 만족하며 사용하고 있는 디바이스에서 사람들에게 가치를 줄 수 있는 서비스를 만들 수 있다는 점이 특히 매력적이었습니다.
                                                            
                    또한 iOS에 대해 공부할수록 사용자가 어떻게 디바이스를 사용할 지 정말 많은 고민이 담겨있다는 것을 느낄 수 있었습니다.
                    특히 Human Interface Guidelines를 보며 항상 사용자가 사용하기 편리한 인터페이스가 무엇인지 많은 고민이 녹여져있다는 것을 느낄 수 있었습니다.
                    이로 인해 안드로이드에 비해 iOS 앱의 완성도가 높다고 생각하는 사람들이 많다고 생각합니다.
                    
                    이외에도 Accessibility를 통해 보다 많은 사람들이 어플리케이션을 편하게 사용할 수 있도록 노력하고 있다는 점도 인상적이었습니다.
                                                            
                    그래서 지금 iOS 개발자가 되기 위해 야곰 아카데미에서 다양한 사람들과 협업을 진행하며 iOS 개발을 공부하고 있습니다.
                    아직 부족한 점도 많지만 더욱 다양한 사람들에게 도움이 되는 어플리케이션을 만들고자 앞으로도 꾸준히 학습하는 개발자가 되고 싶습니다.
                    """
}
